'''
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи.
У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів.
Яку мінімальну кількість столів необхідно придбати?
'''
students_1 = int(input("кількість учнів першої групи "))
students_2 = int(input('кількість учнів другої групи '))
students_3 = int(input('кількість учнів третьої групи '))
print('Мінімальна кількість столів:', students_1//2 + students_1%2 + students_2//2 + students_2%2 + students_3//2 + students_3%2)

