'''
N кеглів виставили в один ряд, занумерованих їх зліва направо числами від 1 до N.

Потім з цього ряду кинули K куль, при цьому i-й куля збив всі кеглі з номерами від li до ri включно. Визначте, які кеглі залишилися стояти на місці.

Програма отримує на вхід кількість кеглів N і кількість кидків K. Далі йде K пар чисел li, ri, при цьому 1≤ li≤ ri≤ N.

Програма повинна вивести послідовність з N символів, де j-й символ є "I", якщо j-я кегля залишилася стояти, або ".", Якщо j-я кегля була збита.
'''
l=[]
r=[]
n, k = [int(e) for e in input("Введіть кількість кеглів(n) і кількість кидків(k) (n k): ").split()]
X = ["I"]*n
for y in range(k):
    a,b = [int(e) for e in input().split()]
    for i in range(a-1,b):
        X[i]="."
for e in X:
    print(e,end='')
