'''
Петя перейшов в іншу школу. На уроці фізкультури йому знадобилося визначити своє місце в строю. Допоможіть йому це зробити.

Програма отримує на вхід незростаючу послідовність натуральних чисел, що означають зріст кожної людини в строю.
Після цього вводиться число X - зріст Петі. Усі числа у вхідних даних натуральні і не перевищують 200. 

Виведіть номер, під яким Петя повинен стати до строю. Якщо в строю є люди з однаковим зростом, таким же, як у Петі, то він повинен встати після них.
'''
H=[int(h) for h in input("Введіть зріст всіх учнів: ").split()]
X=int(input("Введіть зріст Петі: "))
if X>200:
    print('Вводьте лише значення, що не перевищюють 200')
for i in range(0,len(H)-1):
    if H[i]>200:
        print("Вводьте лише значення, що не перевищюють 200]")
    else:
        if H[i]>=X and H[i+1]<X:
            print("Номер Петі в стрю: "+str(i+2))
               
    
        
