'''
Відомо, що на дошці 8 × 8 можна розставити 8 ферзів (королев) так, щоб вони не били один одного.

Вам дана розстановка 8 ферзів на дошці, визначте, чи є серед них пара, що б'ють один одного.

Програма отримує на вхід вісім пар чисел, кожне число від 1 до 8 - координати 8 ферзів. Якщо ферзі не б'ють один одного, виведіть слово NO, інакше виведіть YES.
'''
a = []
for i in range(8):
    a.append(int(input('Введіть першу координату: ')))
    a.append(int(input('Введіть другу координату: ')))
for j in a:
        k = (a[j] + a[j+2])%2
        l = (a[j+1] + a[j+3])%2
        if a[j] == a[j+2] or a[j+1] == a[j+3] \
              or (k == l and a[j+1] == a[j] and a[j+3] == a[j+2]) or (
              k == l and a[j] + a[j+1] == a[j+2] + a[j+3]) or (
              abs((a[j+1] + a[j]) - (a[j+3] + a[j+2])) % 2 == k):
              answer = 'YES'
        else:
          answer = 'NO'
print(answer)
