'''
Умова: Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки.
Визначити, чи може тура перейти з першої клітини у другу за один хід.
Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.
'''
a=int(input("Enter first number:"))
b=int(input("Enter second numer:"))
c=int(input("Enter third number:"))
d=int(input("Enter fourth number:"))
if  a==c or b==d:
    print("YES")
else:
    print("NO")
    
